{"title":{"text":{"headline":"A Timeline of innovation.","text":"<p>Xtrallux is a family business. The founding team is comprised of Maria & Carlos Piña and their daughter, Frances Piña-Brea. Together, their experience in the hair restoration industry spans 4 decades.<\/p>\n<p>The Xtrallux team is well-versed in treatment options for hair loss and advances in medical technology that exist today.<\/p>"}},"events":[{"start_date":{"year":"1996"},"end_date":{"year":"2010"},"text":{"headline":"Entrepreneur Origins","text":"<p>Carlos Pina establishes an agency which serves medical professionals in the fields of beauty and anti-aging among its clients. His clients included renowned hair restoration surgeon, Dr. Bernard Nusbaum, who is a pioneer in hair transplantation surgery and an industry leader. Piña assisted in overseas consultations for international hair transplant candidates as well as handled the practice’s marketing communications.<\/p> \n<p>In addition, having suffered from hair loss himself, Piña undergoes successful hair transplantation surgery with Dr. Nusbaum. During this time, Pina’s daughter joins him in his business after graduating with an MBA from the University of Miami.\n<\/p>"}},{"start_date":{"year":"2010"},"end_date":{"year":"2012"},"text":{"headline":"Discovering Laser Technology","text":"<p>Carlos Pina is introduced to a laser therapy comb as a nonsurgical treatment for hair loss to prevent hair loss and complement other treatments and procedures. Through his personal experience as a hair loss patient and businessman, Carlos Piña first sees the potential to create an effective, wearable, laser product for the treatment of hair loss which is more convenient and efficient than other devices on the market and starts developing a prototype.<\/p>"}},{"media":{"url":"https:\/\/cdn.shopify.com\/s\/files\/1\/0611\/9410\/9168\/files\/Pina_Family_Capillus_History_L1010596.jpg?v=1710793566","caption":"Piña Family attending medical conference."},"start_date":{"year":"2012"},"end_date":{"year":"2021"},"text":{"headline":"Founding of Capillus<sup>1<\/sup>","text":"<p>The Piña family founds the Capillus<sup>1<\/sup>® company & invents the 1st wearable laser cap to be cleared by the FDA for treatment of alopecia. Carlos Pina, along with his daughter Frances, started his first hair restoration laser manufacturing company as a 3-person operation in October of 2012 from the garage of their Miami, Florida home. The laser cap design was a revolutionary introduction to the market at the time which provided clinical strength laser therapy in a wearable design that encouraged compliance. They named this device after the company, Capillus<sup>1<\/sup>.<\/p> <p>During this period of growth, Maria Piña leaves her tenure at the finance department of the University of Miami School of Communications to help the family grow its operations.<\/p><p>As demand increased, the Piñas collaborated with financial partners to expand distribution and diversify products. In 2021, they transitioned the company, now known as Curallux, to their partners.<\/p>"}},{"media":{"url":"https:\/\/cdn.shopify.com\/s\/files\/1\/0611\/9410\/9168\/files\/logo_square_bg.jpg?v=1705614761","caption":""},"start_date":{"year":"2021"},"text":{"headline":"Xtrallux","text":"<p>Returning to their roots, the Pina family founded Xtrallux and began research & development for a new breed of laser therapy cap using their vast knowledge of laser technology to develop a more powerful family of devices to once again satisfy the changing needs of the hair loss market. After many months of product development, testing and setting up their new operation in Miami, Xtrallux was born.<\/p> <p>Xtrallux is a company which is focused on serving the hair restoration industry with the highest caliber of laser products to serve the needs of those wanting to restore and maintain their hair health.<\/p>"}},{"media":{"url":"https:\/\/xtrallux.com\/cdn\/shop\/articles\/Xtrallux_FDA_Clearance_1280x1100_crop_center.jpg?v=1670638660","caption":"FDA Clearance Letter"},"start_date":{"year":"2022"},"text":{"headline":"Xtrallux's FDA Clearance","text":"<p>Xtrallux receives FDA clearance to market Xtrallux medical devices in the USA in October of 2022. With more lasers and more power than ever before, Xtrallux is redefining the market for laser hair restoration.<\/p>"}},{"media":{"url":"https:\/\/xtrallux.com\/cdn\/shop\/collections\/Is_Xtrallux_Laser_Caps_Better_than_Capillus_Direct_Sale.jpg?v=1678906949","caption":"Xtrallux Devices"},"start_date":{"month":"10","year":"2022"},"text":{"headline":"Xtrallux Introduces LLLT Devices","text":"<p>Xtrallux laser devices become widely available in the USA without a prescription. The Xtrallux laser product line includes 4 models; 3 of which are available both directly and through its providers and 1 which is exclusively available through its providers. We prioritize bringing our customers more of everything you’d expect from an industry leaders: xtra lasers, xtra features, xtra value, and xtra results – without superfluous add-ons that don’t provide value.<\/p>"}}]}